---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCImporterService
source: html/1e52565d-49d8-7081-4379-eba9508315a1.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCImporterService Property

The external service which permits registration of an alternate implementation for IFC import.

## Syntax (C#)
```csharp
public static ExternalServiceId IFCImporterService { get; }
```